#### 1. Import pandas library

In [1]:
import numpy as np
import pandas as pd

#### 2. Import BigQuery library

In [2]:
import os
os.environ["GOOGLE_APPLICATION_CREDENTIALS"]="/home/eiroamd/Documents/IH/Ironhack Data Analytics.json"
from google.cloud import bigquery

#### 3. Create a connection to BigQuery

In [3]:
client = bigquery.Client()

#### 4. Import data from the users table from the stackoverflow public database for United Kingdom only

In [4]:
query1 = """
SELECT
    *
FROM
    `bigquery-public-data.stackoverflow.users`
WHERE
    location = 'United Kingdom'
"""

In [5]:
query_job = client.query(query=query1)
df1 = query_job.to_dataframe()
df1.head()

,id,display_name,about_me,age,creation_date,last_access_date,location,reputation,up_votes,down_votes,views,profile_image_url,website_url
0,4203532,Geom3trik,,,2014-10-31 17:50:30.733000+00:00,2019-03-10 17:35:01.870000+00:00,United Kingdom,15,0,0,68,,
1,283230,Danten,Full time student,,2010-02-28 19:45:27.323000+00:00,2013-12-14 14:27:10.543000+00:00,United Kingdom,506,112,2,32,,http://google.com
2,1458346,agrodude,<p>Learning software development after many ye...,,2012-06-15 09:51:10.437000+00:00,2018-04-22 20:26:55.930000+00:00,United Kingdom,30,0,0,30,,
3,3047639,Moynzy,<p>Student studying games development at the U...,,2013-11-29 00:17:24.143000+00:00,2015-06-24 02:48:59.643000+00:00,United Kingdom,23,1,0,15,https://www.gravatar.com/avatar/?s=128&d=ident...,
4,1505458,MunkyOnline,,,2012-07-06 00:15:30.243000+00:00,2012-07-06 00:30:53.660000+00:00,United Kingdom,550,0,0,25,,http://munkyonline.co.uk

#### 5. Rename id column to user_id

In [6]:
df1 = df1.rename(columns={'id': 'user_id'})
df1.head()

,user_id,display_name,about_me,age,creation_date,last_access_date,location,reputation,up_votes,down_votes,views,profile_image_url,website_url
0,4203532,Geom3trik,,,2014-10-31 17:50:30.733000+00:00,2019-03-10 17:35:01.870000+00:00,United Kingdom,15,0,0,68,,
1,283230,Danten,Full time student,,2010-02-28 19:45:27.323000+00:00,2013-12-14 14:27:10.543000+00:00,United Kingdom,506,112,2,32,,http://google.com
2,1458346,agrodude,<p>Learning software development after many ye...,,2012-06-15 09:51:10.437000+00:00,2018-04-22 20:26:55.930000+00:00,United Kingdom,30,0,0,30,,
3,3047639,Moynzy,<p>Student studying games development at the U...,,2013-11-29 00:17:24.143000+00:00,2015-06-24 02:48:59.643000+00:00,United Kingdom,23,1,0,15,https://www.gravatar.com/avatar/?s=128&d=ident...,
4,1505458,MunkyOnline,,,2012-07-06 00:15:30.243000+00:00,2012-07-06 00:30:53.660000+00:00,United Kingdom,550,0,0,25,,http://munkyonline.co.uk

#### 6. Import from the stackoverflow_posts table all items which have up to 20 view counts and only select 'id', 'owner_user_id', 'score', 'view_count', 'comment_count', 'favorite_count'

In [7]:
query2 = """
SELECT
    id,
    owner_user_id,
    score,
    view_count,
    comment_count,
    favorite_count
FROM
    `bigquery-public-data.stackoverflow.stackoverflow_posts`
WHERE
    view_count <= 20
"""

In [8]:
query_job = client.query(query=query2)
df2 = query_job.to_dataframe()
df2.head()

         id  owner_user_id  score  view_count  comment_count  favorite_count
0  28710824            NaN      0          14              0             NaN
1  29126666      3431459.0      0          20              1             NaN
2  33976055            NaN      0           5              0             NaN
3  36240759      3426927.0      0          11              6             NaN
4  36872181      1084774.0      0          17              6             NaN

#### 7. Rename id column to post_id and owner_user_id to user_id

In [9]:
df2 = df2.rename(columns={'id': 'post_id', 'user_ide': 'user_id'})
df2.head()

    post_id  owner_user_id  score  view_count  comment_count  favorite_count
0  28710824            NaN      0          14              0             NaN
1  29126666      3431459.0      0          20              1             NaN
2  33976055            NaN      0           5              0             NaN
3  36240759      3426927.0      0          11              6             NaN
4  36872181      1084774.0      0          17              6             NaN

#### 8. Define new dataframes for users and posts with the following selected columns:
    **users columns**: user_id, reputation,views,up_votes,down_votes
    **posts columns**: post_id, score,user_id,view_count,comment_count

In [10]:
drop_cols_1 = ['display_name', 'about_me', 'age', 'creation_date',
       'last_access_date', 'location']
df3 = df1.drop(drop_cols_1, axis=1)
col_order_1 = ['id', 'reputation', 'views', 'up_votes', 'down_votes',
        'profile_image_url', 'website_url']
df3 = df3[col_order_1]

KeyError: "['id'] not in index"

In [ ]:
df3 = df3.rename(columns={'id': 'user_id'})
df3.head()

In [ ]:
drop_cols_2 = ['favorite_count']
df4 = df2.drop(drop_cols_2, axis=1)
df4.head()

In [ ]:
col_order_2 = ['post_id', 'score', 'user_id', 'view_count', 'comment_count']
df4 = df4[col_order_2]
df4.head()

#### 8. Merge both dataframes, users and posts. 
You will need to make a [merge](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.merge.html) of posts and users dataframes.

In [ ]:
df5 = pd.merge(df3,df4, on='user_id')
df5.head()

#### 9. How many missing values do you have in your merged dataframe?

In [ ]:
df5.isnull().sum()

#### Bonus: Identify extreme values in your merged dataframe, create a dataframe called outliers with the same columns as our data set and calculate the bounds. The values of the outliers dataframe will be the values of the merged_df that fall outside that bounds. You will need to save your outliers dataframe to a csv file on your-code folder. Hint: post_id cannot have outliers!